<?php 
namespace App\Custom;

// class ServiceLogger {}

// 1 Реализовать набор интерфейсов для создания сущности нового метода и (или)ендпоинта
// Model: EndPoint
// GET:/entitymethod/create
// POST:/entitymethod

// 2 api-методы для добавления информации о времени выполнения кода
// 3 Реализовать набор интерфейсов для отображения списка методов и их времени выполнения с пагинацией,
// так же добавить фильтрацию по среднему времени выполнения различных методов.
// А так же наибольшему и наименьшему значению времени выполнения метода

// Предложить универсальные варианты отправки времени с других приложений на сервис логирования. 